
async function CorrectJudge(cosinScore:number[]){

    const A = [-0.00034474917611547777,-0.0003258024223507082,
            0.000010634973111220163,-0.000007313403518995357,
            -0.00014766048861565513,-0.0001509984525748618,
            -0.000011530245224723131,-0.000017375324868538323,
            -0.00009067478184414901,-0.0000977601732528496,
            -0.000029070066749847262,-0.000018353783053462467,
            -0.0005936218390984943,-0.00038366201814519195];

    const B = [-0.0004278937006246829,-0.00016649775068576676,
            -0.00006837225757598765,-0.00022014530619916622,
            0.00017266898470240299,0.00012186591189170781,
            0.000007560490871389785,-0.0000718429088609357,
            -0.0001135718188458883,-0.00006564316849617392, 
            -0.000002036774637365426,-0.0002089905282869987,
            -0.0001643300469041549,0.0001491229224502091];

    const C =[-0.0001418217974446573,0.0000018306931862793823,
            -0.00014669860918360778,-0.00029771222223689864,
            -0.00015034977874403126,0.00017569395113230975,
            0.00003468576417562001,-0.00010609947916151288,
            -0.00008420343544138096,-0.00009277338601153219, 
            0.000028867191398262212,-0.00011070907358090909,
            -0.0001538294729111425,-0.00020521604683319708];

    const AllCorrectAnswer = [A,B,C];
    const AllCorrectAnswerLetter =['A','B','C']       
    
    var Answer = 0;
    // (cosinScore[0]-A[0])**2 + (cosinScore[1]-A[1])**2 .......
    //初回のAの文字はとりあえず保存
    for(var j=0;j<cosinScore.length-1;j++){
        Answer += (cosinScore[j]-A[j])**2;
    };

    var AnswerLetter = AllCorrectAnswerLetter[0];
    
    //A以降の文字は答えたポーズとAの文字のユークリッド距離より値がよければAnswerを更新
    for (var i=1;i<AllCorrectAnswer.length-1;i++){
        var NowAnswer = 0;
        for(var j=0;j<cosinScore.length-1;j++){
            NowAnswer += (cosinScore[j]-AllCorrectAnswer[i][j])**2;
        };
        
        if(NowAnswer<Answer){
            Answer=NowAnswer;
            AnswerLetter=AllCorrectAnswerLetter[i]
        };

    };
    console.log(Answer);
    console.log(AnswerLetter)
    return AnswerLetter;
          
};

export default CorrectJudge;